# -*- mode: org; mode: auto-fill -*-
#+TITLE:   Basic Racket NATS Client
#+startup: showeverything
#+include: "readme.org"

****** COMMENT Improvements

- [X] Handle authorization
- [ ] Handle reconnection
- [ ] Include the custodian in the io struct
# - [ ] Create connection string as struct and convert into jsexpr?

#+BEGIN_SRC racket :lang racket :results output

(define (build-connection-string user password)
  ;; build the connection string
  (let* ([base-string
          (format "{\"verbose\":~s,\"pedantic\":~s" "false" "false")]
         [full-string
          (if (and (not (null? user)) (not (null? password)))
              (string-append base-string (format ",\"user\":~s,\"password\":~s}" user password))
              (string-append base-string "}")
              )])
    full-string
    )
  )

(define (nats-connect
         #:host [host "127.0.0.1"]
         #:port [port 4222]
         #:user [user null]
         #:password [password null])

  (define connect-string 
    (format "CONNECT ~a" 
            (build-connection-string user password)))
  (printf "~a" connect-string)
  )

(nats-connect #:user "hello" #:password "password")
#+END_SRC

#+RESULTS:
: CONNECT {"verbose":"false","pedantic":"false","user":"hello","password":"password"}

